{
  "2025-10-21": {
    "date": "2025-10-21",
    "total_entries": 32,
    "emotion_counts": {
      "joy": 9,
      "sadness": 8,
      "fear": 2,
      "neutral": 13
    },
    "yesterday_counts": {},
    "ai_daily_report": "2025/10/21\nToday's Mood Keywords: neutral, joy, sadness\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: No prior-day comparison available.\nEmotional Summary: The day has a calm baseline with frequent pleasant moments and some low-level sadness.\nAI Observation: The mix of joy and sadness suggests contrasting experiences—a gentle check-in or a short reflective pause could help clarify what’s behind those lows.\nHealing Exercise: Pause for one minute of mindful breathing and notice a single pleasant detail from your day.\nAI's Message: Tiny positive moments add up—notice and keep them in mind."
  },
  "2025-10-22": {
    "date": "2025-10-22",
    "total_entries": 37,
    "emotion_counts": {
      "neutral": 23,
      "sadness": 7,
      "joy": 1,
      "surprise": 3,
      "anger": 3
    },
    "yesterday_counts": {
      "joy": 9,
      "sadness": 8,
      "fear": 2,
      "neutral": 13
    },
    "ai_daily_report": "2025/10/22\nToday's Mood Keywords: neutral, sadness, surprise\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Neutral responses rose noticeably and there were a few surprising spikes; joyful moments dipped.\nEmotional Summary: A generally steady day with pockets of surprise and some low mood signals.\nAI Observation: A rise in neutral responses may mean routine days; surprises could point to unexpected events that shifted mood. A short, compassionate check-in could be useful.\nHealing Exercise: Try a two-minute grounding routine: name 5 things you see, 4 you can touch, 3 sounds, 2 smells, 1 taste.\nAI's Message: Mixed feelings are valid—be kind to yourself and take one small, comforting step today."
  },
  "2025-10-26": {
    "date": "2025-10-26",
    "total_entries": 18,
    "emotion_counts": {
      "joy": 2,
      "sadness": 9,
      "neutral": 6,
      "anger": 1
    },
    "yesterday_counts": {
      "neutral": 23,
      "sadness": 7,
      "joy": 1,
      "surprise": 3,
      "anger": 3
    },
    "ai_daily_report": "2025/10/26\nToday's Mood Keywords: sadness, neutral, joy\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Sadness showed a small uptick while neutral responses eased.\nEmotional Summary: There’s a quiet sadness threaded through the day, with occasional brighter moments.\nAI Observation: When sadness is more present, validating the feeling and offering gentle options (rest, talk, or a small distraction) tends to help.\nHealing Exercise: Write a 3-sentence note to yourself offering compassion—what would you say to a friend in this situation?\nAI's Message: You’re doing what you can—be gentle with yourself and reach out if you want company."
  },
  "2025-10-27": {
    "date": "2025-10-27",
    "total_entries": 4,
    "emotion_counts": {
      "joy": 1,
      "neutral": 3
    },
    "yesterday_counts": {
      "joy": 2,
      "sadness": 9,
      "neutral": 6,
      "anger": 1
    },
    "ai_daily_report": "2025/10/27\nToday's Mood Keywords: neutral, joy\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: A quieter day overall, with small joyful moments punctuating a neutral baseline.\nEmotional Summary: The tone is calm—many moments that feel ordinary, with a few pleasant highlights.\nAI Observation: Neutral days can be restorative; inviting a brief reflection might reveal subtle positives to savor.\nHealing Exercise: Take a short walk and focus on one sensory detail (a sound, a smell) you enjoy.\nAI's Message: Rest and steady days are important—it’s okay to let the quiet refill your energy."
  },
  "2025-10-28": {
    "date": "2025-10-28",
    "total_entries": 10,
    "emotion_counts": {
      "neutral": 9,
      "fear": 1
    },
    "yesterday_counts": {
      "joy": 1,
      "neutral": 3
    },
    "ai_daily_report": "2025/10/28\nToday's Mood Keywords: neutral, fear\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Mostly steady with a small note of worry appearing.\nEmotional Summary: A day that feels generally calm but with a hint of unease for some entries.\nAI Observation: A single fear signal may point to a particular stressor—naming it can reduce its intensity.\nHealing Exercise: Try 5 minutes of progressive muscle relaxation or 2–3 slow, deliberate belly breaths.\nAI's Message: If something’s nagging at you, naming it or sharing it with someone can help lighten the load."
  },
  "2025-10-29": {
    "date": "2025-10-29",
    "total_entries": 46,
    "emotion_counts": {
      "surprise": 1,
      "neutral": 30,
      "joy": 1,
      "sadness": 5,
      "disgust": 9
    },
    "yesterday_counts": {
      "neutral": 9,
      "fear": 1
    },
    "ai_daily_report": "2025/10/29\nToday's Mood Keywords: neutral, disgust, sadness\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: An increase in neutral responses and a notable rise in disgust signals.\nEmotional Summary: The day leans toward steadiness, though irritation or disappointment appears more often than usual.\nAI Observation: Spikes in disgust often link to boundary issues or unmet expectations—consider identifying what felt off and whether any action (small or big) would help.\nHealing Exercise: Try listing one boundary to protect today and one small, simple pleasure to do for yourself.\nAI's Message: You have the right to protect your space—small steps make a difference."
  },
  "2025-10-30": {
    "date": "2025-10-30",
    "total_entries": 42,
    "emotion_counts": {
      "joy": 5,
      "sadness": 8,
      "neutral": 29
    },
    "yesterday_counts": {
      "surprise": 1,
      "neutral": 30,
      "joy": 1,
      "sadness": 5,
      "disgust": 9
    },
    "ai_daily_report": "2025/10/30\nToday's Mood Keywords: neutral, sadness, joy\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Joy and sadness both rose today, creating a mixed emotional picture.\nEmotional Summary: The day shows contrasting moments—hopeful spikes alongside quieter, harder moments.\nAI Observation: Mixed emotions often reflect active coping; both feelings deserve attention—acknowledging them can help you process what’s happening.\nHealing Exercise: Try a quick gratitude micro-practice: name one thing today you appreciated and why.\nAI's Message: It’s okay to hold different feelings at once—both matter and both can guide you forward."
  },
  "2025-10-31": {
    "date": "2025-10-31",
    "total_entries": 84,
    "emotion_counts": {
      "joy": 24,
      "disgust": 1,
      "fear": 12,
      "sadness": 33,
      "neutral": 8,
      "anger": 6
    },
    "yesterday_counts": {
      "joy": 5,
      "sadness": 8,
      "neutral": 29
    },
    "ai_daily_report": "2025/10/31\nToday's Mood Keywords: sadness, joy, fear\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Strong shifts today—both sadness and joy rose notably while neutral responses dropped.\nEmotional Summary: An emotionally intense day with vivid highs and lows.\nAI Observation: Co-occurring high sadness and joy may signal meaningful life events or complex processing; consider reaching out to someone you trust if it feels overwhelming.\nHealing Exercise: Spend five minutes journaling about one strong feeling—what triggered it and what helped, if anything.\nAI's Message: Intense feelings show depth—you're allowed to take time and ask for support when you need it."
  },
  "2025-11-01": {
    "date": "2025-11-01",
    "total_entries": 8,
    "emotion_counts": {
      "joy": 7,
      "sadness": 1
    },
    "yesterday_counts": {
      "neutral": 8,
      "sadness": 33,
      "fear": 12,
      "joy": 24,
      "anger": 6,
      "disgust": 1
    },
    "ai_daily_report": "2025/11/01\nToday's Mood Keywords: Joy, Neutral\n<3–5 emotion keywords derived from today's dominant emotions>\n\nEmotion Trend: Yesterday's sadness and fear counts dropped, while neutral rose slightly, suggesting a shift towards calmer emotions. (Note: Yesterday's data is available.)\nEmotional Summary: Today's emotions reflect a return to more neutral and joyful states.\nAI Observation: The decrease in sadness and fear, along with increased joy, may indicate improved emotional regulation and a positive outlook.\nHealing Exercise: Take a few deep breaths to center your energy and promote a sense of calm.\nAI's Message: It's wonderful to feel this balanced and joyful today. We're here to support you in any way you need."
  }
}
